## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # kubernetes_secret.zerossl_eab_hmac will be destroyed
  # (because kubernetes_secret.zerossl_eab_hmac is not in configuration)
-   resource "kubernetes_secret" "zerossl_eab_hmac" {
-       data      = (sensitive value)
-       id        = "kube-system/zerossl-hmac-key" -> null
-       immutable = false -> null
-       type      = "kubernetes.io/opaque" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "zerossl-hmac-key" -> null
-           namespace        = "kube-system" -> null
-           resource_version = "102864" -> null
-           uid              = "c5fec88a-f2f8-4fb0-97ea-8ab4967c175e" -> null
        }
    }

  # kubernetes_secret.zerossl_eab_hmac_key will be created
+   resource "kubernetes_secret" "zerossl_eab_hmac_key" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "zerossl-hmac-key"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.zerossl_eab_hmac_key_id will be created
+   resource "kubernetes_secret" "zerossl_eab_hmac_key_id" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "zerossl-hmac-key-id"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
